#s = '121212121212121'
#s = s.replace('12','3', 1) # замена первого слева вхождения
#print(s)

# s = s[::-1] РАЗВОРОТ СТРОКИ
# s = s.replace('2222','112',1) ЗАМЕНА ПЕРВОГО ЭЛЕМЕНТА СПРАВА
# s = s[::-1] ПОВТОРНЫЙ РАЗВОРОТ СТРОКИ
# ИНАЧЕ = elif:

# ----------------------------------------------------------

#for n in range(3,10000):
#    s = '1' + '2' * n
#    while '12' in s or '322' in s or '222' in s:
#        if '12' in s:
#             s = s.replace('12', '2',1)
#        if '322' in s:
#            s = s.replace('322', '21',1)
#        if '222' in s:
#            s = s.replace('222', '3',1)
#    if sum([int(x) for x in s]) == 15:
#        print(n)
#        break

# ----------------------------------------------------------

#s = '>' + 10 * '3' + 10 * '5' + 10 * '7'
#while '>3' in s or '>5' in s or '>7' in s:
#    if '>3' in s:
#        s = s.replace('>3','55>', 1)
#    if '>5' in s:
#        s = s.replace('>5','5>3', 1)
#    if '>7' in s:
#        s = s.replace('>7','3>5', 1)
#s = s.replace('>','')
#print(sum([int(x) for x in s]))
# Произвольный порядок можно менять, все равно не поменяется, если в конце сумма чисел в цифре

# ----------------------------------------------------------

#for n in range(4,10000):
#    s = '5' + '2' * n
#    while '52' in s or '2222' in s or '1122' in s:
#        if '52' in s: s = s.replace('52', '11',)
#        if '2222' in s: s = s.replace('2222', '55',)
#        if '1122' in s: s = s.replace('1122', '25',)
#    if sum(int(x) for x in  s) == 64:
#        print(s)
# без 1, т.к нам нужны все вхождения

# ----------------------------------------------------------

#from itertools import product

#a = list(product('12', repeat=16)) # тк от порядка чисел в строек меняется ответ, то пишем перебор всевозможных вариаций

#mx = -float('inf') # для нахождения максимального
#for s in a:
#    s = ''.join(s)
#    if s.count('1') == 12 and s.count('2') == 4:
#        while '11' in s:
#            if '112' in s:
#                s = s.replace('112','7',1)
#            else:
#                s = s.replace('11','3',1)
#        mx = max(mx, sum(int(x) for x in s))
#print(mx)