#x = 3 * 3125**8 + 2 * 625**7 - 4 * 625**6 + 3 * 125**5 - 2 * 25**4 - 2025
#k = 0
#while x > 25:
#    if x % 25 == 0:
#        k += 1
#    x = x // 25 # деление, где результатом остается только целая часть (вместо 11 1)
#print(k)

# ----------------------------------------------------------

#x = 4 * 3125**2019 + 3 * 625**2020 - 2 * 125**2021 + 25*2022 - 4 * 5**2023 - 2024
#k = 0
#while x > 0:
#    if x % 25 > 10:
#        k += 1
#    x //= 25
#print(k)

# ----------------------------------------------------------

#x = 2*729**2014+2*243**2016-2*81**2018+2*27**2020-2*9**2022-2024
#k = 0
#while x > 0:
#    if x % 27 > 9:
#        k += 1
#    x //= 27
#print(k)

# ----------------------------------------------------------

#for x in '0123456789ABCDEFGHI':
#    x1 = int(f'98897{x}21', 19) # 19 отвечает за то, из какой системы мы все это переводим в какую
#    x2 = int(f'2{x}923', 19)
#    if (x1 + x2) % 18 == 0:
#        print(x, (x1+x2) // 18)

# ----------------------------------------------------------

#for x in '0123456789ABCDEFGHIJKLM':
#    x1 = int(f'7{x}38596', 23)
#    x2 = int(f'14{x}36', 23)
#    x3 = int(f'61{x}7', 23)
#    if (x1+x2+x3) % 22 == 0:
#        print(x, (x1+x2+x3) // 22)

# ----------------------------------------------------------

#for x in range(1,2031):
#    k = 0
#    exp1 = 7 ** 170 + 7 ** 100 - x
#    while exp1 > 0:
#        if exp1 % 7 == 0:
#            k += 1
#        exp1 //= 7
#    if k == 71:
#        print(x)
# Новый прототип заданий

# ----------------------------------------------------------

# Если основание системы больше 36

# 43210 (справа налево считаем порядок)
# 51x29 (число)
#for x in range (0,150): # (150-ричная система)
#    x1 = 5 * 150 ** 4 + 1 * 150 ** 3 + x * 150 ** 2 + 2 * 150 ** 1 + 9 * 150 ** 0
#    x2 = x * 150 ** 3 + 2 * 150 ** 1 + 3 * 150 ** 0
# числа в математической модели
#    if (x1+x2) % 149 ==0:
#        print(x,(x1+x2)//149)
# ЕСЛИ ЧИСЛО НАЧИНАЕТСЯ С Х, ТО Х НЕ МОЖЕТ БЫТЬ РАВЕН НУЛЮ

# ----------------------------------------------------------
