#a = [0,1,2,3,4,5]
# mx = max(x for x in a if x % 5 == 0)
# x = 157. x%10 = 7 (последня цифра в числе). если надо найти. для отриц. чисел берем модуль, он же abs()
# ну или например int(str(x))[-1])
#for i in range(0, len(a) -1 ):
  #  print(a[i], a[i+1]) # вывод пар

#for i in range(0, len(a) - 2 ):
 #   print(a[i], a[i+1], a[i+2]) # вывод троек

# f = [0,1,2,3,4,6]
# if 2 in f or 5 in f or 6 f == 2
# print ('ok')
# ok, cuz 2 n 6 in array. count true as 1 => 1+0+1=2

# -------------------------------------------------------------------------------------

#a = [int(x) for x in open('files/17.txt')]
#r = [] # список, куда закидываем элементы
#mn = min(a) # минимальный элемент в а
#for i in range(len(a) - 1): # идем по парам
#    if a[i] % 16 == mn or a[i+1] % 16 == mn:
#        r.append(a[i] + a[i+1]) # сумма элементов
#print(len(r), max(r)) # кол-во элементов из пар в списке и значение максимального элемента

# -------------------------------------------------------------------------------------

#a = [int(x) for x in open('files/17.txt')]
#r = []
#mx = max(x for x in a if abs(x)%10 == 3 and  100 <= abs(x) <= 999) # второй модуль, тк может быть отрицательное число
#for i in range(len(a) - 2):
#    usl1 = (abs(a[i]) % 10 == 3 and 100 <= abs(a[i]) <= 999)
#    usl2 = (abs(a[i + 1]) % 10 == 3 and 100 <= abs(a[i + 1]) <= 999)
#    usl3 = (abs(a[i + 2]) % 10 == 3 and 100 <= abs(a[i + 2]) <= 999)
#    if usl1 or usl2 or usl3:
#        if a[i] + a[i + 1] + a[i + 2] < mx:
#           r.append(a[i] + a[i + 1] + a[i + 2])
#print(len(r), max(r))

# -------------------------------------------------------------------------------------

a = [int(x) for x in open('files/17.txt')]
r = []
a_usl=[x for x in a if x % 17 == 0 and x > 0]
a_usl.sort()
mn1 = a_usl[0]
mn2 = a_usl[1]
mx = max([x for x in a if abs(x)%100==69]) # на 100, тк нужно чтобы число оканчивались на 69
for i in range(len(a)-3):
    if (100<=abs(a[i])<=999) + (100<=abs(a[i+1])<=999) + (100<=abs(a[i+2])<=999) + (100<=abs(a[i+3])<=999) == 2:
        if (a[i]%18==0) + (a[i+1]%18==0) + (a[i+2]%18==0) + (a[i+3]%18==0)== 1:
            if (a[i] + a[i+1] + a[i+2] + a[i+3]) % (mn1+mn2) == 0:
                if (a[i] * a[i+1] * a[i+2] * a[i+3]) <= mx ** 2:
                    r.append((a[i] + a[i+1] + a[i+2] + a[i+3]) ** 2)
print(len(r), min(r))

# ЧТОБЫ НАЙТИ ОСТАТОК, ТО МОДУЛЬ НЕ ПИШЕМ, ДЛЯ ПОСЛЕДНЕЙ ЦИФРЫ ЧИСЛА МОДУЛЬ ПИШЕМ ПРИ % 10
# -------------------------------------------------------------------------------------
