#def f(a,n): - одна куча и номер хода
#def f(a,b,n): - две кучи и номер хода
#if a>= 29 - конец
#  return: n == ? - чей ход
# elif n == 3:
#   return False: - если игра до какого-то там хода
# [f(a*3,n+1), f(a*2,n+1)] - какие-то xоды в игре
# [f(a+3,b,n+1), f(a*2,b,n+1),f(a,b+3,n+1),f(a,b*2,n+1)] - ходы на две кучи
# return any([f(a*3,n+1), f(a*2,n+1)]) - ход игрока
# return all([f(a*3,n+1), f(a*2,n+1)]) - ход противника
# for s in range(1,29): - что-то там для кучи камней
# if f(s,0):
#    print(s)
# for s in range(1,29):
# if f(s,7,0): - две кучи камней
# print(s)
# all если умный противник

#------------------------------------------------------

#def f(a,n):
#   if a>=29 or n > 2:
#        return n == 2
#    if n%2 == 0:
#        return all([f(a+1,n+1),f(a*2,n+1)])
#    return any([f(a+1,n+1),f(a*2,n+1)])

#for s in range(1,29):
#    if f(s,0):
#        print(s)

#------------------------------------------------------

#def f(a,b,n):
#    if a + b >= 211 or n > 4:
#        return n == 2 or n == 4
#    if n % 2 == 0: # чей ход
#        return all([f(a +1 ,b, n + 1), f(a * 2,b, n + 1),f(a,b+1,n+1), f(a,b*2,n+1)])
#    return any([f(a +1 ,b, n + 1), f(a * 2,b, n + 1),f(a,b+1,n+1), f(a,b*2,n+1)])
#print([s for s in range (1,194) if f(17,s,0)])

#49
#88,96
#87,95. 87 по условию нельзя

#------------------------------------------------------

# Задача на ограничение камней в куче
def f(a,n):
    if a>= 65:
        if a <=100:
            return n % 2 == 0
        return n % 2 == 1
    elif n == 4:
        return False
    if n%2==0:  # умная игра
        return all([f(a+1,n+1),f(a*3,n+1)])
    return any([f(a+1,n+1),f(a*3,n+1)])
print([s for s in range (1,65) if f(s,0)])

#8
#21,62
#61,63
# если в elif подставить 2 ход, то выпадет 63, что нарушает условие игры, поэтому 61
